uhnp/src/InformationRegisters/ДоговорыПоЗакупочнымПроцедурам/ДоговорыПоЗакупочнымПроцедурам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорыПоЗакупочнымПроцедурам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лот</name>
    <type>
      <types>DocumentRef.Лот</types>
      <types>CatalogRef.Лоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ДоговорыПоЗакупочнымПроцедурам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
Процедура ЗаполнитьНаборЗаписей(НаборЗаписей,
								ВерсияДоговораОбъект,
								мЛоты) Экспорт
	Если ВерсияДоговораОбъект <> Неопределено
				И ЗначениеЗаполнено(ВерсияДоговораОбъект.Ссылка) Тогда
		Для Каждого Лот Из мЛоты Цикл
			Если ЗначениеЗаполнено(Лот) И ТипЗНЧ(Лот) = ТИП("ДокументСсылка.Лот") Тогда
				Движение = НаборЗаписей.Добавить();
				Движение.Период = ВерсияДоговораОбъект.Дата;
				Движение.ЗакупочнаяПроцедура = Лот.ЗакупочнаяПроцедура;
				Движение.Договор = ВерсияДоговораОбъект.ДоговорКонтрагента;
				Движение.Лот = Лот;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


#КонецЕсли
